api/tests/stress/results/ab_auth_me.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/auth/me
Document Length:        2263 bytes

Concurrency Level:      20
Time taken for tests:   4.044 seconds
Complete requests:      100
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      245200 bytes
HTML transferred:       226300 bytes
Requests per second:    24.73 [#/sec] (mean)
Time per request:       808.714 [ms] (mean)
Time per request:       40.436 [ms] (mean, across all concurrent requests)
Transfer rate:          59.22 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        7   35  32.9     21     128
Processing:    74  714 177.2    730     995
Waiting:       57  712 177.6    730     995
Total:         86  748 165.8    763    1124

Percentage of the requests served within a certain time (ms)
  50%    763
  66%    827
  75%    852
  80%    872
  90%    939
  95%    953
  98%    983
  99%   1124
 100%   1124 (longest request)