api/tests/stress/results/ab_auth_me.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/auth/me
Document Length:        2263 bytes

Concurrency Level:      20
Time taken for tests:   3.930 seconds
Complete requests:      100
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      253000 bytes
HTML transferred:       226300 bytes
Requests per second:    25.45 [#/sec] (mean)
Time per request:       785.938 [ms] (mean)
Time per request:       39.297 [ms] (mean, across all concurrent requests)
Transfer rate:          62.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        6   30  29.2     16     108
Processing:    72  695 156.0    746     888
Waiting:       64  694 156.1    746     888
Total:         79  724 146.3    763     996

Percentage of the requests served within a certain time (ms)
  50%    763
  66%    789
  75%    810
  80%    819
  90%    846
  95%    886
  98%    974
  99%    996
 100%    996 (longest request)