api/tests/stress/results/ab_daily_records.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/daily-records
Document Length:        39 bytes

Concurrency Level:      20
Time taken for tests:   2.701 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Keep-Alive requests:    0
Total transferred:      39500 bytes
HTML transferred:       3900 bytes
Requests per second:    37.03 [#/sec] (mean)
Time per request:       540.137 [ms] (mean)
Time per request:       27.007 [ms] (mean, across all concurrent requests)
Transfer rate:          14.28 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        6   25  22.6     17      80
Processing:    41  471 111.2    505     624
Waiting:       35  470 111.6    503     624
Total:         55  496 105.0    522     703

Percentage of the requests served within a certain time (ms)
  50%    522
  66%    538
  75%    554
  80%    562
  90%    588
  95%    604
  98%    699
  99%    703
 100%    703 (longest request)