api/tests/stress/results/ab_daily_usage.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/daily-records/report/daily-usage
Document Length:        39 bytes

Concurrency Level:      20
Time taken for tests:   3.531 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Keep-Alive requests:    0
Total transferred:      39500 bytes
HTML transferred:       3900 bytes
Requests per second:    28.32 [#/sec] (mean)
Time per request:       706.153 [ms] (mean)
Time per request:       35.308 [ms] (mean, across all concurrent requests)
Transfer rate:          10.93 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        8   26  19.9     18      72
Processing:    43  634 248.2    637    1047
Waiting:       39  632 248.0    637    1047
Total:         63  660 239.6    645    1057

Percentage of the requests served within a certain time (ms)
  50%    645
  66%    825
  75%    869
  80%    882
  90%    995
  95%   1003
  98%   1057
  99%   1057
 100%   1057 (longest request)