api/tests/stress/results/ab_dashboard_all.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/dashboard/all
Document Length:        1935 bytes

Concurrency Level:      20
Time taken for tests:   4.354 seconds
Complete requests:      100
Failed requests:        51
   (Connect: 0, Receive: 0, Length: 51, Exceptions: 0)
Non-2xx responses:      51
Keep-Alive requests:    0
Total transferred:      130480 bytes
HTML transferred:       96804 bytes
Requests per second:    22.97 [#/sec] (mean)
Time per request:       870.829 [ms] (mean)
Time per request:       43.541 [ms] (mean, across all concurrent requests)
Transfer rate:          29.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   29  20.1     20      69
Processing:    63  797 377.0    698    1448
Waiting:       56  796 377.3    698    1448
Total:         68  826 376.7    721    1469

Percentage of the requests served within a certain time (ms)
  50%    721
  66%   1121
  75%   1202
  80%   1275
  90%   1358
  95%   1416
  98%   1466
  99%   1469
 100%   1469 (longest request)