api/tests/stress/results/ab_dashboard_all.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/dashboard/all
Document Length:        1870 bytes

Concurrency Level:      20
Time taken for tests:   3.492 seconds
Complete requests:      100
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      205900 bytes
HTML transferred:       187000 bytes
Requests per second:    28.64 [#/sec] (mean)
Time per request:       698.407 [ms] (mean)
Time per request:       34.920 [ms] (mean, across all concurrent requests)
Transfer rate:          57.58 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        6   24  23.8     13      79
Processing:    58  605 171.2    641     869
Waiting:       51  603 171.2    638     868
Total:         66  628 157.8    651     879

Percentage of the requests served within a certain time (ms)
  50%    651
  66%    696
  75%    724
  80%    747
  90%    799
  95%    827
  98%    862
  99%    879
 100%    879 (longest request)