api/tests/stress/results/ab_tickets_list.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/tickets
Document Length:        17412 bytes

Concurrency Level:      20
Time taken for tests:   9.048 seconds
Complete requests:      100
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      1760100 bytes
HTML transferred:       1741200 bytes
Requests per second:    11.05 [#/sec] (mean)
Time per request:       1809.647 [ms] (mean)
Time per request:       90.482 [ms] (mean, across all concurrent requests)
Transfer rate:          189.96 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        4   35  43.0     19     154
Processing:    97 1632 364.9   1737    2102
Waiting:       95 1631 364.7   1737    2095
Total:        102 1667 355.8   1754    2254

Percentage of the requests served within a certain time (ms)
  50%   1754
  66%   1826
  75%   1872
  80%   1895
  90%   1941
  95%   1965
  98%   2178
  99%   2254
 100%   2254 (longest request)