api/tests/stress/results/ab_tickets_list.txt
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.ddev.site (be patient).....done


Server Software:        nginx
Server Hostname:        api.ddev.site
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        X25519 253 bits
TLS Server Name:        api.ddev.site

Document Path:          /api/v1/tickets
Document Length:        39 bytes

Concurrency Level:      20
Time taken for tests:   2.611 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Keep-Alive requests:    0
Total transferred:      39500 bytes
HTML transferred:       3900 bytes
Requests per second:    38.31 [#/sec] (mean)
Time per request:       522.110 [ms] (mean)
Time per request:       26.106 [ms] (mean, across all concurrent requests)
Transfer rate:          14.78 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        7   29  27.1     18     103
Processing:    35  453 108.1    473     607
Waiting:       27  452 108.5    471     607
Total:         45  483 102.3    506     706

Percentage of the requests served within a certain time (ms)
  50%    506
  66%    522
  75%    539
  80%    557
  90%    591
  95%    610
  98%    652
  99%    706
 100%    706 (longest request)